spec/fixtures/express_checkout/recurring/update_profile/failure.yml

--- 
http_interactions: 
- request: 
    method: post
    uri: https://api-3t.sandbox.paypal.com/nvp
    body: 
      encoding: US-ASCII
      string: USER=chardy_api1.gmail.com&PWD=8DTSWBZC7GDR3T4X&SIGNATURE=AG-8mOpuFhFyFOYHlaTUYn3Syf15AWJKRnfHMVsmCtC3DK51-ENEPqLS&VERSION=72.0&PAYMENTREQUEST_0_AMT=10.00&AMT=10.00&PROFILEID=I-2YXA7FG2X8AJ&METHOD=UpdateRecurringPaymentsProfile
    headers: 
      User-Agent: 
      - PayPal::Payment/0.1
  response: 
    status: 
      code: 200
      message: OK
    headers: 
      Date: 
      - Wed, 27 Feb 2013 16:38:14 GMT
      Server: 
      - Apache
      Content-Length: 
      - "309"
      Connection: 
      - close
      Content-Type: 
      - text/plain; charset=utf-8
    body: 
      encoding: ASCII-8BIT
      string: PROFILEID=I%2d2YXA7FG2X8AJ&TIMESTAMP=2013%2d02%2d27T16%3a38%3a14Z&CORRELATIONID=103fb1273ad08&ACK=Failure&VERSION=72%2e0&BUILD=5294323&L_ERRORCODE0=11520&L_SHORTMESSAGE0=Invalid%20currency%20for%20amount&L_LONGMESSAGE0=This%20currency%20is%20currently%20not%20supported%20for%20amount%2e&L_SEVERITYCODE0=Error
    http_version: 
  recorded_at: Wed, 27 Feb 2013 16:38:15 GMT
recorded_with: VCR 2.3.0
